/*flags.c -- 演示一些格式标记*/
#include <stdio.h>
int main(void)
{
<<<<<<< HEAD
    printf("%x %X %#x\n", 31, 31, 31); // 31的十六进制表示，%x小写，%X大写，%#x带0x前缀
    printf("**%d**%d**%d**\n", 42,42,-42); // 42的十进制表示，**表示宽度为2，前后各加一个*号
    printf("**%5d**%5.3d**%05d**%05.3d**\n", 6, 6, 6, 6); // 5d表示宽度为5，前面补空格，3d表示精度为3，前面补0
=======
    printf("%x%X%#x\n", 31, 31, 31);
    printf("**%d**%d/**%d\n", 42, 42, -42);
    printf("**%5d**%5.3d**%05d**%05.3d**\n", 6, 6, 6, 6);
>>>>>>> 5e23f7c873e342e175e8fc46b34d681f298c92e8
    return 0;
}