// 2.假设所有变量的类型都是int, 下列各项变量的值是多少:
/*
a.x = (int)3.8 + 3.3;
b.x = (2 + 3) * 10.5;
c.x = 3 / 5 * 22.0;
d.x = 22.0 * 3 / 5;
*/

#include <stdio.h>
int main(void)
{
    int x;
    // a.x = (int)3.8 + 3.3
    x = (int)3.8 + 3.3; // (int)3.8 = 3, 3 + 3.3 = 6.3，赋值int后为6
    printf("a.x = %d\n", x);

    // b.x = (2 + 3) * 10.5
    x = (2 + 3) * 10.5; // 5 * 10.5 = 52.5, 赋值给int后为52
    printf("b.x = %d\n", x);

    // c.x = 3 / 5 * 22.0
    x = 3 / 5 * 22.0; // 3 / 5 = 0 (整数除法), 0 * 22.0 = 0.0 -> 赋值为0
    printf("c.x = %d\n", x);

    // d.x = 22.0 * 3 / 5;
    x = 22.0 * 3 / 5; // 22.0 * 3 = 66.0 / 5 = 13.2 -> 赋值为13
    printf("d.x = %d\n", x);

    return 0;
}