// 5.10 复习题
// 1.假设所有的变量的类型都是int, 下列各项变量的值是多少?
/*
a.x = (2 + 3) * 6
b.x = (12 + 6) / 2 * 3
c.y = x = (2 + 3) / 4
d.y = 3 + 2 * (x = 7 / 2)
*/

#include <stdio.h>
int main(void)
{
    int x, y;
    // a.x = (2 + 3) * 6
    x = (2 + 3) * 6;
    printf("a.x = %d\n", x); // 输出30

    // b.x = (12 + 2) / 23
    x = (12 + 6) / 23;
    printf("b.x = %d\n", x); // 输出0，因为18/23=0 (整数除法)

    // c.y = x = (2 + 3) / 4;
    y = x = (2 + 3) / 4; // 5 / 4 = 1
    printf("c.x = %d, y = %d\n", x, y); // 输出x = 1, y = 1

    // d.y = 3 + 2 * (x = 7 / 2);
    y = 3 + 2 * (x = 7 / 2); // x = 3, y = 3 + 2 * 3 = 9
    printf("d.x = %d, y = %d\n", x, y); // 输出x = 3, y = 9

    return 0;
}